package com.sist.main;
/*
 *    SpringFrameWork 
 *      자바기반 (코틀린) => 애플리케이션 개발을 위한 기본 틀 제공
 *                                         -------
 *      
 *      핵심 : 결합성이 낮은 프로그램 개발 (유지 보수)
 *            클래스 수정 => 다른 클래스에 영향을 미침
 *            ------------------------------- 방지
 *            
 *            객체 생성 / 관리 / 객체 소멸까지 담당
 *            
 *      => DI  (객체 연결)
 *      => AOP (공통 기반의 기능을 모아서 자동 처리)
 *      => MVC (웹 요청 처리)
 *      => ORM (데이터베이스 연동) : MyBatis / JPA
 *      => Security
 * 
 */
public class MainClass {

}
